# Index 다루기 
- index의 일부 변경하는 경우

- 특정 column을 index로 설정하는 경우

- 기존 index에 새로 추가하는 경우

- 0-base index로 리셋하는 설정하는 경우

In [88]:
# 모듈 로딩
import pandas as pd
# df 객체 생성
df = pd.DataFrame({'이름':['서준','우현','인아'],'수학':[100,98,99], '영어':[87,98,76], '음악':[90,87,99], '체육':[98,99,90]})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   수학      3 non-null      int64
 2   영어      3 non-null      int64
 3   음악      3 non-null      int64
 4   체육      3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes

In [89]:
df

   이름   수학  영어  음악  체육
0  서준  100  87  90  98
1  우현   98  98  87  99
2  인아   99  76  99  90

In [90]:
# df의 속성 읽기 -> index, columns, shape
print(df.index)
print(df.columns)
print(df.shape)

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '수학', '영어', '음악', '체육'], dtype='object')
(3, 5)

# 특정 column을 index로 설정
- 조건 : 중복 / NaN(Not a Number, 빈칸) 이면 쓸 수 없음
- 생성 : df객체변수명.set_index('column명', inplace = False) <- 기본값
- df객체변수명.set_index(['column명', column명], inplace = False) <- 기본값

In [91]:
# 이름 column -> 행 index로 설정하고싶다,
df.set_index('이름', inplace = True)
df

     수학  영어  음악  체육
이름
서준  100  87  90  98
우현   98  98  87  99
인아   99  76  99  90

In [92]:
df.index

Index(['서준', '우현', '인아'], dtype='object', name='이름')

# Index 초기화(reset)
- 기존의 column index는 다시 column으로 돌려준다.
- method = df객체변수명.reset_index()

In [93]:
df.reset_index(inplace=True)
df

   이름   수학  영어  음악  체육
0  서준  100  87  90  98
1  우현   98  98  87  99
2  인아   99  76  99  90

In [94]:
# 행(row) 추가
df.loc[3] = ['인아',94,67,84,77]
df

   이름   수학  영어  음악  체육
0  서준  100  87  90  98
1  우현   98  98  87  99
2  인아   99  76  99  90
3  인아   94  67  84  77

In [95]:
# 특정 column을 index로 설정, 멀티 인덱스
df2 = df.set_index(['이름', '음악'])
df2

        수학  영어  체육
이름 음악
서준 90  100  87  98
우현 87   98  98  99
인아 99   99  76  90
   84   94  67  77

# Index 재배열 설정
- 기존 인덱스에 변경을 가하는 것
- 원본 적용 inplace=False가 기본값이다.
- 메소드 : df객체변수명.reindex([인덱스 list], fill_value=값)

In [96]:
df

   이름   수학  영어  음악  체육
0  서준  100  87  90  98
1  우현   98  98  87  99
2  인아   99  76  99  90
3  인아   94  67  84  77

In [97]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [99]:
df1 = df.reindex([0,1,2,3,4,5], fill_value='-')
df1

   이름   수학  영어  음악  체육
0  서준  100  87  90  98
1  우현   98  98  87  99
2  인아   99  76  99  90
3  인아   94  67  84  77
4   -    -   -   -   -
5   -    -   -   -   -

In [100]:
df1 = df.reindex(['a','b','c','d','e'], fill_value='-')
df1

  이름 수학 영어 음악 체육
a  -  -  -  -  -
b  -  -  -  -  -
c  -  -  -  -  -
d  -  -  -  -  -
e  -  -  -  -  -

# Index & Column 일부분 변경
- 기존 인덱스/컬럼에서 일부분 변경하는 메소드
- df객체변수명.rename(index={기존:new}, column={기존:new}, inplace = False)

In [101]:
df

   이름   수학  영어  음악  체육
0  서준  100  87  90  98
1  우현   98  98  87  99
2  인아   99  76  99  90
3  인아   94  67  84  77

In [115]:
df.rename(columns={'이름':'Name','수학':'Math','영어':'English',
                   '음악':'Music','체육':'Work'})

  Name  Math  English  Music  Work
0   서준   100       87     90    98
1   우현    98       98     87    99
2   인아    99       76     99    90
3   인아    94       67     84    77